# Electrical System Cable Size Property

Source: https://www.revitapidocs.com/2026/8e27a566-84db-c1e8-3290-9b1f02db70ce.htm

---

| Electrical System Cable Size Property |
| --- |

The Cable Size of the Electrical System.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId CableSize { get; set; }
```

```
Public Property CableSize As ElementId
	Get
	Set
```

```
public:
property ElementId^ CableSize {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

```
member CableSize : ElementId with get, set
```

#### Property Value

ElementId Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The id is not a Cable Size id nor invalidElementId.  \-or\-  When setting this property: The Cable Size can not be used by the current Cable Type. |
| ArgumentNullException | When setting this property: A non\-optional argument was null |

See Also

#### Reference

ElectricalSystem Class Autodesk.Revit.DB.Electrical Namespace